---
kind: method
id: M:Autodesk.Revit.DB.FabricationHostedInfo.Dispose
source: html/9e861f64-a83d-ba91-5377-2db30dbdd312.htm
---
# Autodesk.Revit.DB.FabricationHostedInfo.Dispose Method

Releases all resources used by the FabricationHostedInfo

## Syntax (C#)
```csharp
public void Dispose()
```